chore: update gallery
